package com.example.alarmapplication.alarm_View_Models

import androidx.lifecycle.ViewModel

/**
 * ViewModel для управления будильниками.
 * Этот класс отвечает за подготовку и управление данными для пользовательского интерфейса,
 * связанными с будильниками, включая инициализацию и обработку настроек или самих будильников.
 * В будущем класс может быть дополнен методами добавления, удаления или обновления будильников.
 */
class AlarmsViewModel : ViewModel() {
    // Здесь будут добавлены методы для взаимодействия с данными о будильниках.
}
